{"name": "model", "trainable": true, "layers": [{"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 384, 708], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1"}, "registered_name": null, "name": "input_1", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "Masking", "config": {"name": "masking", "trainable": false, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}, "batch_input_shape": [null, 384, 708], "mask_value": -100.0}, "registered_name": null, "build_config": {"input_shape": [null, 384, 708]}, "name": "masking", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "stem_conv", "trainable": false, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}, "units": 192, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 384, 708]}, "name": "stem_conv", "inbound_nodes": [[["masking", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "stem_bn", "trainable": false, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}, "axis": [2], "momentum": 0.95, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 384, 192]}, "name": "stem_bn", "inbound_nodes": [[["stem_conv", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "1_expand_conv", "trainable": false, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}, "units": 384, "activation": "swish", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 384, 192]}, "name": "1_expand_conv", "inbound_nodes": [[["stem_bn", 0, 0, {}]]]}, {"module": "model", "class_name": "CausalDWConv1D", "config": {"name": "1_dwconv", "trainable": false, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}, "dilation_rate": 1, "use_bias": false, "kernel_size": 17}, "registered_name": "CausalDWConv1D", "build_config": {"input_shape": [null, 384, 384]}, "name": "1_dwconv", "inbound_nodes": [[["1_expand_conv", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "1_bn", "trainable": false, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}, "axis": [2], "momentum": 0.95, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 384, 384]}, "name": "1_bn", "inbound_nodes": [[["1_dwconv", 0, 0, {}]]]}, {"module": "model", "class_name": "ECA", "config": {"name": "eca", "trainable": false, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}}, "registered_name": "ECA", "build_config": {"input_shape": [null, 384, 384]}, "name": "eca", "inbound_nodes": [[["1_bn", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "1_project_conv", "trainable": false, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}, "units": 192, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 384, 384]}, "name": "1_project_conv", "inbound_nodes": [[["eca", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "1_drop", "trainable": false, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}, "rate": 0.2, "noise_shape": [null, 1, 1], "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 384, 192]}, "name": "1_drop", "inbound_nodes": [[["1_project_conv", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Add", "config": {"name": "1_add", "trainable": false, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}}, "registered_name": null, "build_config": {"input_shape": [[null, 384, 192], [null, 384, 192]]}, "name": "1_add", "inbound_nodes": [[["1_drop", 0, 0, {}], ["stem_bn", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "2_expand_conv", "trainable": false, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}, "units": 384, "activation": "swish", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 384, 192]}, "name": "2_expand_conv", "inbound_nodes": [[["1_add", 0, 0, {}]]]}, {"module": "model", "class_name": "CausalDWConv1D", "config": {"name": "2_dwconv", "trainable": false, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}, "dilation_rate": 1, "use_bias": false, "kernel_size": 17}, "registered_name": "CausalDWConv1D", "build_config": {"input_shape": [null, 384, 384]}, "name": "2_dwconv", "inbound_nodes": [[["2_expand_conv", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "2_bn", "trainable": false, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}, "axis": [2], "momentum": 0.95, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 384, 384]}, "name": "2_bn", "inbound_nodes": [[["2_dwconv", 0, 0, {}]]]}, {"module": "model", "class_name": "ECA", "config": {"name": "eca_1", "trainable": false, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}}, "registered_name": "ECA", "build_config": {"input_shape": [null, 384, 384]}, "name": "eca_1", "inbound_nodes": [[["2_bn", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "2_project_conv", "trainable": false, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}, "units": 192, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 384, 384]}, "name": "2_project_conv", "inbound_nodes": [[["eca_1", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "2_drop", "trainable": false, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}, "rate": 0.2, "noise_shape": [null, 1, 1], "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 384, 192]}, "name": "2_drop", "inbound_nodes": [[["2_project_conv", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Add", "config": {"name": "2_add", "trainable": false, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}}, "registered_name": null, "build_config": {"input_shape": [[null, 384, 192], [null, 384, 192]]}, "name": "2_add", "inbound_nodes": [[["2_drop", 0, 0, {}], ["1_add", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "3_expand_conv", "trainable": false, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}, "units": 384, "activation": "swish", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 384, 192]}, "name": "3_expand_conv", "inbound_nodes": [[["2_add", 0, 0, {}]]]}, {"module": "model", "class_name": "CausalDWConv1D", "config": {"name": "3_dwconv", "trainable": false, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}, "dilation_rate": 1, "use_bias": false, "kernel_size": 17}, "registered_name": "CausalDWConv1D", "build_config": {"input_shape": [null, 384, 384]}, "name": "3_dwconv", "inbound_nodes": [[["3_expand_conv", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "3_bn", "trainable": false, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}, "axis": [2], "momentum": 0.95, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 384, 384]}, "name": "3_bn", "inbound_nodes": [[["3_dwconv", 0, 0, {}]]]}, {"module": "model", "class_name": "ECA", "config": {"name": "eca_2", "trainable": false, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}}, "registered_name": "ECA", "build_config": {"input_shape": [null, 384, 384]}, "name": "eca_2", "inbound_nodes": [[["3_bn", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "3_project_conv", "trainable": false, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}, "units": 192, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 384, 384]}, "name": "3_project_conv", "inbound_nodes": [[["eca_2", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "3_drop", "trainable": false, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}, "rate": 0.2, "noise_shape": [null, 1, 1], "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 384, 192]}, "name": "3_drop", "inbound_nodes": [[["3_project_conv", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Add", "config": {"name": "3_add", "trainable": false, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}}, "registered_name": null, "build_config": {"input_shape": [[null, 384, 192], [null, 384, 192]]}, "name": "3_add", "inbound_nodes": [[["3_drop", 0, 0, {}], ["2_add", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "batch_normalization", "trainable": false, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}, "axis": [2], "momentum": 0.95, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 384, 192]}, "name": "batch_normalization", "inbound_nodes": [[["3_add", 0, 0, {}]]]}, {"module": "model", "class_name": "MultiHeadSelfAttention", "config": {"name": "multi_head_self_attention", "trainable": false, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}, "dim": 192, "num_heads": 4, "dropout": 0.2}, "registered_name": "MultiHeadSelfAttention", "build_config": {"input_shape": [null, 384, 192]}, "name": "multi_head_self_attention", "inbound_nodes": [[["batch_normalization", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "dropout_1", "trainable": false, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}, "rate": 0.2, "noise_shape": [null, 1, 1], "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 384, 192]}, "name": "dropout_1", "inbound_nodes": [[["multi_head_self_attention", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Add", "config": {"name": "add", "trainable": false, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}}, "registered_name": null, "build_config": {"input_shape": [[null, 384, 192], [null, 384, 192]]}, "name": "add", "inbound_nodes": [[["3_add", 0, 0, {}], ["dropout_1", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_1", "trainable": false, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}, "axis": [2], "momentum": 0.95, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 384, 192]}, "name": "batch_normalization_1", "inbound_nodes": [[["add", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_2", "trainable": false, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}, "units": 384, "activation": "swish", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 384, 192]}, "name": "dense_2", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_3", "trainable": false, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}, "units": 192, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 384, 384]}, "name": "dense_3", "inbound_nodes": [[["dense_2", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "dropout_2", "trainable": false, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}, "rate": 0.2, "noise_shape": [null, 1, 1], "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 384, 192]}, "name": "dropout_2", "inbound_nodes": [[["dense_3", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Add", "config": {"name": "add_1", "trainable": false, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}}, "registered_name": null, "build_config": {"input_shape": [[null, 384, 192], [null, 384, 192]]}, "name": "add_1", "inbound_nodes": [[["add", 0, 0, {}], ["dropout_2", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "4_expand_conv", "trainable": false, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}, "units": 384, "activation": "swish", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 384, 192]}, "name": "4_expand_conv", "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"module": "model", "class_name": "CausalDWConv1D", "config": {"name": "4_dwconv", "trainable": false, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}, "dilation_rate": 1, "use_bias": false, "kernel_size": 17}, "registered_name": "CausalDWConv1D", "build_config": {"input_shape": [null, 384, 384]}, "name": "4_dwconv", "inbound_nodes": [[["4_expand_conv", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "4_bn", "trainable": false, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}, "axis": [2], "momentum": 0.95, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 384, 384]}, "name": "4_bn", "inbound_nodes": [[["4_dwconv", 0, 0, {}]]]}, {"module": "model", "class_name": "ECA", "config": {"name": "eca_3", "trainable": false, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}}, "registered_name": "ECA", "build_config": {"input_shape": [null, 384, 384]}, "name": "eca_3", "inbound_nodes": [[["4_bn", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "4_project_conv", "trainable": false, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}, "units": 192, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 384, 384]}, "name": "4_project_conv", "inbound_nodes": [[["eca_3", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "4_drop", "trainable": false, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}, "rate": 0.2, "noise_shape": [null, 1, 1], "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 384, 192]}, "name": "4_drop", "inbound_nodes": [[["4_project_conv", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Add", "config": {"name": "4_add", "trainable": false, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}}, "registered_name": null, "build_config": {"input_shape": [[null, 384, 192], [null, 384, 192]]}, "name": "4_add", "inbound_nodes": [[["4_drop", 0, 0, {}], ["add_1", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "5_expand_conv", "trainable": false, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}, "units": 384, "activation": "swish", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 384, 192]}, "name": "5_expand_conv", "inbound_nodes": [[["4_add", 0, 0, {}]]]}, {"module": "model", "class_name": "CausalDWConv1D", "config": {"name": "5_dwconv", "trainable": false, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}, "dilation_rate": 1, "use_bias": false, "kernel_size": 17}, "registered_name": "CausalDWConv1D", "build_config": {"input_shape": [null, 384, 384]}, "name": "5_dwconv", "inbound_nodes": [[["5_expand_conv", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "5_bn", "trainable": false, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}, "axis": [2], "momentum": 0.95, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 384, 384]}, "name": "5_bn", "inbound_nodes": [[["5_dwconv", 0, 0, {}]]]}, {"module": "model", "class_name": "ECA", "config": {"name": "eca_4", "trainable": false, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}}, "registered_name": "ECA", "build_config": {"input_shape": [null, 384, 384]}, "name": "eca_4", "inbound_nodes": [[["5_bn", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "5_project_conv", "trainable": false, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}, "units": 192, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 384, 384]}, "name": "5_project_conv", "inbound_nodes": [[["eca_4", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "5_drop", "trainable": false, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}, "rate": 0.2, "noise_shape": [null, 1, 1], "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 384, 192]}, "name": "5_drop", "inbound_nodes": [[["5_project_conv", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Add", "config": {"name": "5_add", "trainable": false, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}}, "registered_name": null, "build_config": {"input_shape": [[null, 384, 192], [null, 384, 192]]}, "name": "5_add", "inbound_nodes": [[["5_drop", 0, 0, {}], ["4_add", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "6_expand_conv", "trainable": false, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}, "units": 384, "activation": "swish", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 384, 192]}, "name": "6_expand_conv", "inbound_nodes": [[["5_add", 0, 0, {}]]]}, {"module": "model", "class_name": "CausalDWConv1D", "config": {"name": "6_dwconv", "trainable": false, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}, "dilation_rate": 1, "use_bias": false, "kernel_size": 17}, "registered_name": "CausalDWConv1D", "build_config": {"input_shape": [null, 384, 384]}, "name": "6_dwconv", "inbound_nodes": [[["6_expand_conv", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "6_bn", "trainable": false, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}, "axis": [2], "momentum": 0.95, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 384, 384]}, "name": "6_bn", "inbound_nodes": [[["6_dwconv", 0, 0, {}]]]}, {"module": "model", "class_name": "ECA", "config": {"name": "eca_5", "trainable": false, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}}, "registered_name": "ECA", "build_config": {"input_shape": [null, 384, 384]}, "name": "eca_5", "inbound_nodes": [[["6_bn", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "6_project_conv", "trainable": false, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}, "units": 192, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 384, 384]}, "name": "6_project_conv", "inbound_nodes": [[["eca_5", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "6_drop", "trainable": false, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}, "rate": 0.2, "noise_shape": [null, 1, 1], "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 384, 192]}, "name": "6_drop", "inbound_nodes": [[["6_project_conv", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Add", "config": {"name": "6_add", "trainable": false, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}}, "registered_name": null, "build_config": {"input_shape": [[null, 384, 192], [null, 384, 192]]}, "name": "6_add", "inbound_nodes": [[["6_drop", 0, 0, {}], ["5_add", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_2", "trainable": false, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}, "axis": [2], "momentum": 0.95, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 384, 192]}, "name": "batch_normalization_2", "inbound_nodes": [[["6_add", 0, 0, {}]]]}, {"module": "model", "class_name": "MultiHeadSelfAttention", "config": {"name": "multi_head_self_attention_1", "trainable": false, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}, "dim": 192, "num_heads": 4, "dropout": 0.2}, "registered_name": "MultiHeadSelfAttention", "build_config": {"input_shape": [null, 384, 192]}, "name": "multi_head_self_attention_1", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "dropout_4", "trainable": false, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}, "rate": 0.2, "noise_shape": [null, 1, 1], "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 384, 192]}, "name": "dropout_4", "inbound_nodes": [[["multi_head_self_attention_1", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Add", "config": {"name": "add_2", "trainable": false, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}}, "registered_name": null, "build_config": {"input_shape": [[null, 384, 192], [null, 384, 192]]}, "name": "add_2", "inbound_nodes": [[["6_add", 0, 0, {}], ["dropout_4", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_3", "trainable": false, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}, "axis": [2], "momentum": 0.95, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 384, 192]}, "name": "batch_normalization_3", "inbound_nodes": [[["add_2", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_6", "trainable": false, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}, "units": 384, "activation": "swish", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 384, 192]}, "name": "dense_6", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_7", "trainable": false, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}, "units": 192, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 384, 384]}, "name": "dense_7", "inbound_nodes": [[["dense_6", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "dropout_5", "trainable": false, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}, "rate": 0.2, "noise_shape": [null, 1, 1], "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 384, 192]}, "name": "dropout_5", "inbound_nodes": [[["dense_7", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Add", "config": {"name": "add_3", "trainable": false, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}}, "registered_name": null, "build_config": {"input_shape": [[null, 384, 192], [null, 384, 192]]}, "name": "add_3", "inbound_nodes": [[["add_2", 0, 0, {}], ["dropout_5", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "top_conv", "trainable": false, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}, "units": 384, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 384, 192]}, "name": "top_conv", "inbound_nodes": [[["add_3", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "GlobalAveragePooling1D", "config": {"name": "global_average_pooling1d", "trainable": false, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}, "data_format": "channels_last", "keepdims": false}, "registered_name": null, "build_config": {"input_shape": [null, 384, 384]}, "name": "global_average_pooling1d", "inbound_nodes": [[["top_conv", 0, 0, {}]]]}, {"module": "model", "class_name": "LateDropout", "config": {"name": "late_dropout", "trainable": false, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}, "supports_masking": true, "rate": 0.8, "start_step": 270, "dropout": {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "dropout_6", "trainable": false, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}, "rate": 0.8, "noise_shape": null, "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 384]}}}, "registered_name": "LateDropout", "build_config": {"input_shape": [null, 384]}, "name": "late_dropout", "inbound_nodes": [[["global_average_pooling1d", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "classifier", "trainable": true, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}, "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 384]}, "name": "classifier", "inbound_nodes": [[["late_dropout", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["classifier", 0, 0]]}